
INSERT INTO `contracts` (`ID`, `Orderer_Name`, `Orderer_Address`, `Date_of_Registration`, `Date_of_Execution`) VALUES
(1, 'Олег', 'Магнитогорск, ул Карла Маркса 125', '2022-02-09', '2022-02-11'),
(2, 'Дмитрий', 'Москва, ул Кирова 21', '2022-02-09', '2022-02-19'),
(3, 'Александр', 'Нижний Новгород, ул Петрозвадская 47', '2022-02-10', '2022-02-15');


INSERT INTO `workshop` (`ID`, `Name`, `Chief`, `Telephone`) VALUES
(1, 'Печатающий цех', 'Павлович Андрей Сергеевич', '89375625654'),
(2, 'Изготавливающий цех', 'Киркоров Кирилл Александрович', '79374565562'),
(3, 'Режущий цех', 'Телегин Арнольд Тагирович', '88005553535');


INSERT INTO `products` (`ID`, `Name`, `Workshop_ID`, `Price`) VALUES
(1, 'Календарь', 1, '60.50'),
(2, 'Буклет', 2, '100.00'),
(3, 'Визитки', 3, '10.00');




INSERT INTO `orders` (`ID`, `Product_ID`, `Quantity`, `Contract_ID`) VALUES
(1, 1, 12, 1),
(2, 2, 3, 2),
(3, 3, 134, 3);


