



INSERT INTO `workshop` (`ID`, `Name`, `Cheif_FullName`) VALUES
(1, 'Обрабатывающий цех', 'Устинов Альберт Геннадьевич'),
(2, 'Сборочный цех', 'Аркадьев Алексей Петрович');




INSERT INTO `workers` (`ID`, `FullName`, `Post`, `Discount`, `Workshop_ID`) VALUES
(1, 'Федосеев Игнат Дмитриевич', 'Мастер', '0.05', 1),
(2, 'Абрамов Дмитрий Михайлович', 'Старший Мастер', '0.10', 1),
(3, 'Петров Леонард Викторович', 'Заместитель начальника цеха', '0.25', 2);



INSERT INTO `workwear_type` (`ID`, `Name`) VALUES
(1, 'Халаты'),
(2, 'Тапочки'),
(3, 'Комбенизоны');


INSERT INTO `workwear` (`ID`, `Type_ID`, `Wear_Period`, `Price`) VALUES
(1, 1, '2 Месяца', '200.00'),
(2, 2, '6 Месяцев', '150.00'),
(3, 3, '7 Месяцев', '400.00');



INSERT INTO `receiving` (`Worker_ID`, `Workwear_ID`, `Date_of_Receipt`, `Signature`) VALUES
(1, 1, '2021-01-22', 'Игнат'),
(1, 2, '2021-01-22', 'Игнат'),
(1, 3, '2021-01-22', 'Игнат'),
(2, 1, '2021-02-04', 'Дима'),
(2, 2, '2021-02-04', 'Дима'),
(2, 3, '2021-02-04', 'Дима'),
(3, 1, '2021-02-17', 'Леонид'),
(3, 2, '2021-02-17', 'Леонид');
