

INSERT INTO `banks` (`ID`, `Name`, `Address`) VALUES
(1234, 'Сбербанк', 'Москва, Ул Пушкина 56'),
(4245, 'АльфаБанк', 'Москва, Ул Ленинская 23'),
(4256, 'ТинькоффБанк', 'Москва, Ул Кирова 245');

INSERT INTO `atms` (`ID`, `Bank_ID`, `Address`) VALUES
(12, 4245, 'Москва, ул Ленинская 77'),
(23, 4256, 'Москва, Вокзальная 25'),
(55, 1234, 'Москва, ул Кирова 44');


INSERT INTO `clients` (`ID`, `FullName`, `Address`, `Bank_ID`) VALUES
(2144, 'Орехов Константин Игоревич', 'Москва, ул Кирова 58 ', 1234),
(2345, 'Мышкин Петр Платонович', 'Москва, ул Кольцевая 52', 4245),
(2456, 'Суханов Демьян Платонович', 'Москва, ул Ленинская 57', 4256);


INSERT INTO `atm_client` (`Atm_ID`, `Client_ID`) VALUES
(12, 2144),
(23, 2144),
(23, 2345),
(55, 2456);






INSERT INTO `operations` (`ID`, `Client_ID`, `Atm_ID`, `Amount`, `DateTime`, `Commission`) VALUES
(1, 2144, 12, '2000.00', '2022-02-06 08:14:08', 'Нет'),
(2, 2345, 23, '150.00', '2022-02-10 10:14:09', 'Да');


