

INSERT INTO `clients` (`ID`, `FullName`, `Address`, `Telephone`) VALUES
(1, 'Беляков Тарас Степанович', 'Магнитогорск, ул Звенягина 45', '78945612345'),
(2, 'Самсонов Матвей Вениаминович', 'Магнитогорск, ул Труда 45', '78945612332'),
(3, 'Красильников Макар Кириллович', 'Магнитогорск, ул Вокзальная 32', '78945623215');



INSERT INTO `firms` (`ID`, `Name`, `Address`, `Telephone`) VALUES
(1, 'Лукойл', 'Магнитогорск, ул Сталеваров 65', '789456125332'),
(2, 'Роснефть', 'Магнитогорск, ул Ленина ', '789456123321'),
(3, 'Слав-Нефть', 'Магнитогорск, ул Карла Маркса 45', '894566152345');




INSERT INTO `fuels` (`ID`, `Type`, `Unit`, `Price`) VALUES
(1, 'Бензин - 92', 'Литр', '78.99'),
(2, 'Бензин - 95', 'литр', '80.00'),
(3, 'Газ', 'литр', '30.00');


INSERT INTO `firm_fuel` (`Firm_ID`, `Fuel_ID`) VALUES
(1, 1),
(1, 2),
(1, 3),
(2, 1),
(2, 2),
(2, 3),
(3, 1),
(3, 2),
(3, 3);


INSERT INTO `gas_stations` (`ID`, `Firm_ID`, `Address`) VALUES
(1, 1, 'Магнитогорск, ул Карла Маркса 45'),
(2, 1, 'Москва, ул Пушкина 45'),
(3, 3, 'Челябинск, ул Черная 12'),
(4, 2, 'Магнитогорск, ул Ленина 12');



INSERT INTO `sales` (`ID`, `Date`, `Client_ID`, `GasStation_ID`, `Fuel_ID`, `Quantiry`) VALUES
(1, '2022-02-09', 3, 1, 3, 14),
(2, '2022-02-11', 3, 4, 2, 10),
(3, '2022-02-26', 1, 2, 1, 5),
(4, '2022-02-26', 2, 1, 2, 16),
(5, '2022-02-27', 2, 4, 1, 12),
(6, '2022-02-27', 1, 3, 3, 16),
(7, '2022-02-28', 3, 4, 1, 10);
