INSERT INTO `clients` (`ID`, `Name`, `Address`, `Telephone`) VALUES
(1, 'ШКола №5', 'Магнитогорск, ул Киров 54', '89365465895'),
(2, 'Офис банка Сбербанк', 'Магнитогорск, ул Ленина 47', '79895625456'),
(3, 'Детский Сад Радуга', 'Магнитогорск, Вокзальная 74', '79562564589');
INSERT INTO `furnitures` (`ID`, `Name`, `Model`, `Сharacteristic`, `Price`) VALUES
(1, 'Стол компьютерный', 'ск-1', 'Деревянный, широкий', '1500.00'),
(2, 'Шкаф', 'Ш-3', 'Двухдверный, деревянный', '2500.00'),
(3, 'Стул', 'С-1', 'Офисный, раскладной', '1000.00');

INSERT INTO `contracts` (`ID`, `Client_ID`, `Date_of_Registration`, `Date_of_Execution`) VALUES
(1, 1, '2022-02-08', '2022-02-09'),
(2, 3, '2022-02-10', '2022-02-11'),
(3, 2, '2022-02-13', '2022-02-14');




INSERT INTO `sales` (`ID`, `Name`, `Quantity`, `Model`, `Contract_ID`) VALUES
(1, 'Шкаф', 3, 2, 2),
(2, 'Стул', 50, 3, 3),
(3, 'Стол компьютерный', 12, 1, 1);

